docs/posts/2022-06-06-harmony-of-the-gospels.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Apr 08, 2025 19:52 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Harmony of the Gospels</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Harmony of the Gospels</h1>
<p class="subtitle" role="doc-subtitle">Jan 21, 2023 00:00</p>
</header><p>
This is a schedule for a study of the Gospels in our Sunday School Class at NorthHaven Church.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Date</td>
<td class="org-left">Subject</td>
<td class="org-left">Text</td>
</tr>

<tr>
<td class="org-left">6/19</td>
<td class="org-left">Introduction</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">6/26</td>
<td class="org-left">Jesus&rsquo; Genealogy</td>
<td class="org-left">Matthew 1:1-17, Luke 3:23-38</td>
</tr>

<tr>
<td class="org-left">7/3</td>
<td class="org-left">Leaving Egypt and Settling in Nazareth</td>
<td class="org-left">Matthew 2:19-23, Luke 2:39</td>
</tr>

<tr>
<td class="org-left">7/10</td>
<td class="org-left">John the Baptist&rsquo;s Ministry</td>
<td class="org-left">Matthew 3:1-12, Mark 1:1-8, Luke 3:1-18</td>
</tr>

<tr>
<td class="org-left">7/17</td>
<td class="org-left">The Baptism of Jesus</td>
<td class="org-left">Matthew 3:13-17, Mark 1:9-11, Luke 3:21-22</td>
</tr>

<tr>
<td class="org-left">7/24</td>
<td class="org-left">Jesus&rsquo; Temptation in the Wilderness</td>
<td class="org-left">Matthew 4:1-11, Mark 1:12-13, Luke 4:1-13</td>
</tr>

<tr>
<td class="org-left">7/31</td>
<td class="org-left">Jesus&rsquo; Arrival and Early Ministry in Galilee</td>
<td class="org-left">Matthew 4:12, Mark 1:14-15, Luke 4:14-15, John 4:43-45</td>
</tr>

<tr>
<td class="org-left">8/7</td>
<td class="org-left">Jesus Calls Four Disciples</td>
<td class="org-left">Matthew 4:18-22, Mark 1:16-20</td>
</tr>

<tr>
<td class="org-left">8/14</td>
<td class="org-left">Jesus Authenticates His Teaching in Capernaum by Healing a Demoniac</td>
<td class="org-left">Mark 1:21-28, Luke 4:31-37</td>
</tr>

<tr>
<td class="org-left">8/21</td>
<td class="org-left">Jesus Heals Peter&rsquo;s Mother-in-Law and Others</td>
<td class="org-left">Matthew 8:14-17, Mark 1:29-34, Luke 4:38-41</td>
</tr>

<tr>
<td class="org-left">8/28</td>
<td class="org-left">Jesus&rsquo; Preaching Tour of Galilee with Simon and Others</td>
<td class="org-left">Matthew 4:23-25, Mark 1:35-39, Luke 4:42-44</td>
</tr>

<tr>
<td class="org-left">8/28</td>
<td class="org-left">A Leper Healed by Jesus</td>
<td class="org-left">Matthew 8:1-4, Mark 1:40-45, Luke 5:12-16</td>
</tr>

<tr>
<td class="org-left">9/4</td>
<td class="org-left">A Paralytic is Forgiven and Healed</td>
<td class="org-left">Matthew 9:1-8, Mark 2:1-12, Luke 5:17-26</td>
</tr>

<tr>
<td class="org-left">9/11</td>
<td class="org-left">Levi/Matthew is Called to be a Disciple</td>
<td class="org-left">Matthew 9:9-13, Mark 2:13-17, Luke 5:27-32</td>
</tr>

<tr>
<td class="org-left">9/18</td>
<td class="org-left">Jesus is Questioned About Fasting</td>
<td class="org-left">Matthew 9:14-17, Mark 2:18-22, Luke 5:33-39</td>
</tr>

<tr>
<td class="org-left">9/25</td>
<td class="org-left">Jesus&rsquo; Disciples Pluck Grain on a Sabbath</td>
<td class="org-left">Matthew 12:1-8, Mark 2:23-28, Luke 6:1-5</td>
</tr>

<tr>
<td class="org-left">10/2</td>
<td class="org-left">Jesus Heals a Man&rsquo;s Withered Hand on a Sabbath</td>
<td class="org-left">Matthew 12:9-14, Mark 3:1-6, Luke 6:6-11</td>
</tr>

<tr>
<td class="org-left">10/9</td>
<td class="org-left">Jesus&rsquo; Popularity Grows</td>
<td class="org-left">Matthew 12:15-21, Mark 3:7-12</td>
</tr>

<tr>
<td class="org-left">10/16</td>
<td class="org-left">The Twelve Disciples Chosen and Named</td>
<td class="org-left">Mark 3:13-19, Luke 6:12-16</td>
</tr>

<tr>
<td class="org-left">10/23</td>
<td class="org-left">Characteristics of the Godly</td>
<td class="org-left">Matthew 5:1-16, Luke 6:17-26</td>
</tr>

<tr>
<td class="org-left">10/30</td>
<td class="org-left">Jesus Practically Applies the Meaning of the Law</td>
<td class="org-left">Matthew 5:21-48, Luke 6:27-36</td>
</tr>

<tr>
<td class="org-left">11/6</td>
<td class="org-left">Wise Words on Judging</td>
<td class="org-left">Matthew 7:1-6, Luke 6:37-42</td>
</tr>

<tr>
<td class="org-left">11/13</td>
<td class="org-left">Jesus&rsquo; Words on Righteous Living</td>
<td class="org-left">Matthew 7:13-27, Luke 6:43-49</td>
</tr>

<tr>
<td class="org-left">11/20</td>
<td class="org-left">The Centurion&rsquo;s Servant Healed</td>
<td class="org-left">Matthew 8:5-13, Luke 7:1-10</td>
</tr>

<tr>
<td class="org-left">11/27</td>
<td class="org-left">Messages From and About John the Baptist</td>
<td class="org-left">Matthew 11:2-30, Luke 7:18-35</td>
</tr>

<tr>
<td class="org-left">12/4</td>
<td class="org-left">Jesus Responds to Accusations of Casting Out Demons by Beelzebub</td>
<td class="org-left">Matthew 12:22-45, Mark 3:20-30</td>
</tr>

<tr>
<td class="org-left">12/11</td>
<td class="org-left">Jesus&rsquo; True Family is Spiritual</td>
<td class="org-left">Matthew 12:46-50, Mark 3:31-35, Luke 8:19-21</td>
</tr>

<tr>
<td class="org-left">12/18</td>
<td class="org-left">The Parable of the Soils</td>
<td class="org-left">Matthew 13:1-9, Mark 4:1-9, Luke 8:4-8</td>
</tr>

<tr>
<td class="org-left">1/8</td>
<td class="org-left">The Reason for the Parables</td>
<td class="org-left">Matthew 13:10-17, Mark 4:10-12, Luke 8:9-10</td>
</tr>

<tr>
<td class="org-left">1/15</td>
<td class="org-left">Parable of the Soils Explained</td>
<td class="org-left">Matthew 13:18-23, Mark 4:13-20, Luke 8:11-15</td>
</tr>

<tr>
<td class="org-left">1/22</td>
<td class="org-left">Jesus Speaks on the Use of Parables</td>
<td class="org-left">Mark 4:21-25, Luke 8:16-18</td>
</tr>

<tr>
<td class="org-left">1/22</td>
<td class="org-left">The Parable of the Mustard Seed and Tree</td>
<td class="org-left">Matthew 13:31-32, Mark 4:30-32</td>
</tr>

<tr>
<td class="org-left">1/29</td>
<td class="org-left">Jesus&rsquo; Custom of Speaking in Parables</td>
<td class="org-left">Matthew 13:34-35, Mark 4:33-34</td>
</tr>

<tr>
<td class="org-left">2/5</td>
<td class="org-left">Jesus Calms the Storm</td>
<td class="org-left">Matthew 8:18-27, Mark 4:35-41, Luke 8:22-25</td>
</tr>

<tr>
<td class="org-left">2/12</td>
<td class="org-left">Healing the Gerasene Demoniacs</td>
<td class="org-left">Matthew 8:28-34, Mark 5:1-20, Luke 8:26-39</td>
</tr>

<tr>
<td class="org-left">2/26</td>
<td class="org-left">The Raising of Jairus&rsquo; Daughter, and Other Acts of Healing</td>
<td class="org-left">Matthew 9:18-34, Mark 5:21-43, Luke 8:40-56</td>
</tr>

<tr>
<td class="org-left">3/5</td>
<td class="org-left">A Final Visit to Unbelieving Nazareth</td>
<td class="org-left">Matthew 13:54-58, Mark 6:1-6</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Shortage of Laborers</td>
<td class="org-left">Matthew 9:35-38, Mark 6:6</td>
</tr>

<tr>
<td class="org-left">3/12</td>
<td class="org-left">Jesus Sends Forth the Twelve for Ministry</td>
<td class="org-left">Matthew 10:1-42, Mark 6:7-11, Luke 9:1-5</td>
</tr>

<tr>
<td class="org-left">3/19</td>
<td class="org-left">The Departure of Jesus and the Disciples</td>
<td class="org-left">Matthew 11:1, Mark 6:12-13, Luke 9:6</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">The Death of John the Baptist</td>
<td class="org-left">Matthew 14:1-12, Mark 6:14-29, Luke 9:7-9</td>
</tr>

<tr>
<td class="org-left">3/26</td>
<td class="org-left">Return of the Disciples</td>
<td class="org-left">Mark 6:30, Luke 9:10</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Jesus Feeds Five Thousand</td>
<td class="org-left">Matthew 14:13-21, Mark 6:31-44, Luke 9:10-17, John 6:1-15</td>
</tr>

<tr>
<td class="org-left">4/2</td>
<td class="org-left">Jesus Walks on the Sea</td>
<td class="org-left">Matthew 14:22-33, Mark 6:45-52, John 6:16-21</td>
</tr>

<tr>
<td class="org-left">4/9</td>
<td class="org-left">Healings at Gennesaret</td>
<td class="org-left">Matthew 14:34-36, Mark 6:53-56</td>
</tr>

<tr>
<td class="org-left">4/9</td>
<td class="org-left">Traditions and Commandments</td>
<td class="org-left">Matthew 15:1-20, Mark 7:1-23, John 7:1</td>
</tr>

<tr>
<td class="org-left">4/16</td>
<td class="org-left">The Syrophoenician Woman&rsquo;s Faith</td>
<td class="org-left">Matthew 15:21-28, Mark 7:24-30</td>
</tr>

<tr>
<td class="org-left">4/23</td>
<td class="org-left">Jesus Returns to the Sea of Galilee</td>
<td class="org-left">Matthew 15:29-31, Mark 7:31-37</td>
</tr>

<tr>
<td class="org-left">4/23</td>
<td class="org-left">Jesus Feeds Four Thousand</td>
<td class="org-left">Matthew 15:32-39, Mark 8:1-10</td>
</tr>

<tr>
<td class="org-left">4/30</td>
<td class="org-left">Pharisees Demand a Sign from Jesus</td>
<td class="org-left">Matthew 16:1-12, Mark 8:11-21</td>
</tr>

<tr>
<td class="org-left">5/7</td>
<td class="org-left">Peter&rsquo;s Confession of Jesus as the Christ</td>
<td class="org-left">Matthew 16:13-20, Mark 8:27-30, Luke 9:18-21</td>
</tr>

<tr>
<td class="org-left">5/7</td>
<td class="org-left">Jesus Foretells His Death</td>
<td class="org-left">Matthew 16:21-28, Mark 8:31-9:1, Luke 9:22-27</td>
</tr>

<tr>
<td class="org-left">5/14</td>
<td class="org-left">The Transfiguration</td>
<td class="org-left">Matthew 17:1-13, Mark 9:2-13, Luke 9:28-36</td>
</tr>

<tr>
<td class="org-left">5/21</td>
<td class="org-left">Healing of a Demoniac Boy</td>
<td class="org-left">Matthew 17:14-21, Mark 9:14-29, Luke 9:37-43</td>
</tr>

<tr>
<td class="org-left">5/28</td>
<td class="org-left">Jesus Foretells His Death Again</td>
<td class="org-left">Matthew 17:22-23, Mark 9:30-32, Luke 9:43-45</td>
</tr>

<tr>
<td class="org-left">5/28</td>
<td class="org-left">Who is Greatest in God&rsquo;s Kingdom?</td>
<td class="org-left">Matthew 18:1-5, Mark 9:33-37, Luke 9:46-48</td>
</tr>

<tr>
<td class="org-left">6/4</td>
<td class="org-left">Warning Against Being a Stumbling Block</td>
<td class="org-left">Matthew 18:6-14, Mark 9:38-50, Luke 9:49-50</td>
</tr>

<tr>
<td class="org-left">6/11</td>
<td class="org-left">The Departure from Galilee</td>
<td class="org-left">Matthew 19:1-2, Mark 10:1, Luke 9:51-56, John 7:10</td>
</tr>

<tr>
<td class="org-left">6/11</td>
<td class="org-left">Jesus&rsquo; Teaching on Divorce</td>
<td class="org-left">Matthew 19:3-12, Mark 10:2-12</td>
</tr>

<tr>
<td class="org-left">6/18</td>
<td class="org-left">Jesus Blesses the Little Children</td>
<td class="org-left">Matthew 19:13-15, Mark 10:13-16, Luke 18:15-17</td>
</tr>

<tr>
<td class="org-left">6/25</td>
<td class="org-left">The Rich Young Man</td>
<td class="org-left">Matthew 19:16-30, Mark 10:17-31, Luke 18:18-30</td>
</tr>

<tr>
<td class="org-left">7/2</td>
<td class="org-left">Jesus Predicts His Death Again</td>
<td class="org-left">Matthew 20:17-19, Mark 10:32-34, Luke 18:31-34</td>
</tr>

<tr>
<td class="org-left">7/9</td>
<td class="org-left">Warning Against Ambitious Pride</td>
<td class="org-left">Matthew 20:20-28, Mark 10:35-45</td>
</tr>

<tr>
<td class="org-left">7/16</td>
<td class="org-left">Blind Bartimaeus and Companion Healed</td>
<td class="org-left">Matthew 20:29-34, Mark 10:46-52, Luke 18:35-43</td>
</tr>

<tr>
<td class="org-left">7/23</td>
<td class="org-left">Mary&rsquo;s Anointing of Jesus for Burial</td>
<td class="org-left">Matthew 26:6-13, Mark 14:3-9, John 12:2-8</td>
</tr>

<tr>
<td class="org-left">7/30</td>
<td class="org-left">The Triumphal Entry</td>
<td class="org-left">Matthew 21:1-11, Mark 11:1-11, Luke 19:29-44, John 12:12-19</td>
</tr>

<tr>
<td class="org-left">8/6</td>
<td class="org-left">The Cursing of the Fig Tree</td>
<td class="org-left">Matthew 21:18-19, Mark 11:12-14</td>
</tr>

<tr>
<td class="org-left">8/6</td>
<td class="org-left">Second Cleansing of the Temple</td>
<td class="org-left">Matthew 21:12-17, Mark 11:15-19, Luke 19:45-48</td>
</tr>

<tr>
<td class="org-left">8/13</td>
<td class="org-left">The Lesson of the Withered Fig Tree</td>
<td class="org-left">Matthew 21:18-22, Mark 11:20-25</td>
</tr>

<tr>
<td class="org-left">8/20</td>
<td class="org-left">Jesus&rsquo; Authority Challenged</td>
<td class="org-left">Matthew 21:23-27, Mark 11:27-33, Luke 20:1-8</td>
</tr>

<tr>
<td class="org-left">8/27</td>
<td class="org-left">Parable of the Tenants</td>
<td class="org-left">Matthew 21:33-46, Mark 12:1-12, Luke 20:9-19</td>
</tr>

<tr>
<td class="org-left">8/27</td>
<td class="org-left">Paying Taxes to Caesar</td>
<td class="org-left">Matthew 22:15-22, Mark 12:13-17, Luke 20:20-26</td>
</tr>

<tr>
<td class="org-left">9/3</td>
<td class="org-left">Marriage and the Resurrection</td>
<td class="org-left">Matthew 22:23-33, Mark 12:18-27, Luke 20:27-38</td>
</tr>

<tr>
<td class="org-left">9/10</td>
<td class="org-left">The Greatest Commandment</td>
<td class="org-left">Matthew 22:34-40, Mark 12:28-34, Luke 20:39-40</td>
</tr>

<tr>
<td class="org-left">9/17</td>
<td class="org-left">Question About the Son of David</td>
<td class="org-left">Matthew 22:41-46, Mark 12:35-37, Luke 20:41-44</td>
</tr>

<tr>
<td class="org-left">9/24</td>
<td class="org-left">Listen to the Pharisees, but Don&rsquo;t Follow Their Deeds</td>
<td class="org-left">Matthew 23:1-12, Mark 12:38-40, Luke 20:45-47</td>
</tr>

<tr>
<td class="org-left">10/1</td>
<td class="org-left">The Poor Widow&rsquo;s Offering</td>
<td class="org-left">Mark 12:41-44, Luke 21:1-4</td>
</tr>

<tr>
<td class="org-left">10/8</td>
<td class="org-left">Destruction of the Temple Foretold by Jesus</td>
<td class="org-left">Matthew 24:1-2, Mark 13:1-2, Luke 21:5-6</td>
</tr>

<tr>
<td class="org-left">10/15</td>
<td class="org-left">Signs of the End of the Age</td>
<td class="org-left">Matthew 24:3-14, Mark 13:3-13, Luke 21:7-19</td>
</tr>

<tr>
<td class="org-left">10/22</td>
<td class="org-left">The Abomination of Desolation</td>
<td class="org-left">Matthew 24:15-28, Mark 13:14-23, Luke 21:20-24</td>
</tr>

<tr>
<td class="org-left">10/29</td>
<td class="org-left">The Coming of the Son of Man</td>
<td class="org-left">Matthew 24:29-31, Mark 13:24-27, Luke 21:25-28</td>
</tr>

<tr>
<td class="org-left">11/5</td>
<td class="org-left">The Unknown Day and Hour</td>
<td class="org-left">Matthew 24:32-44, Mark 13:28-37, Luke 21:29-33</td>
</tr>

<tr>
<td class="org-left">11/5</td>
<td class="org-left">The Faithful or the Unfaithful Slave</td>
<td class="org-left">Matthew 24:45-51, Luke 21:34-36</td>
</tr>

<tr>
<td class="org-left">11/12</td>
<td class="org-left">The Chief Priests Plot to Kill Jesus</td>
<td class="org-left">Matthew 26:1-5, Mark 14:1-2, Luke 22:1-2</td>
</tr>

<tr>
<td class="org-left">11/19</td>
<td class="org-left">Judas Bargains to Betray Jesus</td>
<td class="org-left">Matthew 26:14-16, Mark 14:10-11, Luke 22:3-6</td>
</tr>

<tr>
<td class="org-left">11/26</td>
<td class="org-left">Passover Meal Preparation</td>
<td class="org-left">Matthew 26:17-19, Mark 14:12-16, Luke 22:7-13</td>
</tr>

<tr>
<td class="org-left">11/26</td>
<td class="org-left">Beginning of the Passover Meal</td>
<td class="org-left">Matthew 26:20, Mark 14:17, Luke 22:14-16</td>
</tr>

<tr>
<td class="org-left">11/26</td>
<td class="org-left">Jesus&rsquo; Betrayer Identified</td>
<td class="org-left">Matthew 26:21-25, Mark 14:18-21, Luke 22:21-23, John 13:21-30</td>
</tr>

<tr>
<td class="org-left">12/3</td>
<td class="org-left">Jesus Predicts Peter&rsquo;s Denial</td>
<td class="org-left">Luke 22:31-38, John 13:31-38</td>
</tr>

<tr>
<td class="org-left">12/10</td>
<td class="org-left">Lord&rsquo;s Supper Instituted</td>
<td class="org-left">Matthew 26:26-29, Mark 14:22-25, Luke 22:17-20</td>
</tr>

<tr>
<td class="org-left">12/17</td>
<td class="org-left">Second Prediction of Peter&rsquo;s Denial</td>
<td class="org-left">Matthew 26:30-35, Mark 14:26-31</td>
</tr>

<tr>
<td class="org-left">12/31</td>
<td class="org-left">Jesus&rsquo; Prayer in Gethsemane</td>
<td class="org-left">Matthew 26:36-46, Mark 14:32-42, Luke 22:39-46</td>
</tr>

<tr>
<td class="org-left">1/7</td>
<td class="org-left">The Betrayal and Arrest</td>
<td class="org-left">Matthew 26:47-56, Mark 14:43-52, Luke 22:47-53, John 18:1-12</td>
</tr>

<tr>
<td class="org-left">1/14</td>
<td class="org-left">Jesus&rsquo; Trial Before the Sanhedrin</td>
<td class="org-left">Matthew 26:57-68, Mark 14:53-65, Luke 22:54</td>
</tr>

<tr>
<td class="org-left">1/21</td>
<td class="org-left">Peter Denies Jesus</td>
<td class="org-left">Matthew 26:69-75, Mark 14:66-72, Luke 22:55-62, John 18:25-27</td>
</tr>

<tr>
<td class="org-left">1/28</td>
<td class="org-left">Jesus Still Before the Sanhedrin</td>
<td class="org-left">Matthew 27:1, Mark 15:1, Luke 22:63-71</td>
</tr>

<tr>
<td class="org-left">2/4</td>
<td class="org-left">Jesus Before Pilate</td>
<td class="org-left">Matthew 27:2, 11-14, Mark 15:1-5, Luke 23:1-5, John 18:28-38</td>
</tr>

<tr>
<td class="org-left">2/11</td>
<td class="org-left">Jesus Back Before Pilate</td>
<td class="org-left">Matthew 27:15-26, Mark 15:6-15, Luke 23:13-25, John 18:39-19:16</td>
</tr>

<tr>
<td class="org-left">2/18</td>
<td class="org-left">Roman Soldiers Mock Jesus</td>
<td class="org-left">Matthew 27:27-31, Mark 15:16-20</td>
</tr>

<tr>
<td class="org-left">2/25</td>
<td class="org-left">The Crucifixion</td>
<td class="org-left">Matthew 27:32-56, Mark 15:21-41, Luke 23:26-49, John 19:17-37</td>
</tr>

<tr>
<td class="org-left">3/3</td>
<td class="org-left">The Burial of Jesus</td>
<td class="org-left">Matthew 27:57-61, Mark 15:42-47, Luke 23:50-56, John 19:38-42</td>
</tr>

<tr>
<td class="org-left">3/10</td>
<td class="org-left">The Resurrection Morning</td>
<td class="org-left">Matthew 28:1-10, Mark 16:1-11, Luke 24:1-12, John 20:1-18</td>
</tr>

<tr>
<td class="org-left">3/17</td>
<td class="org-left">The Walk to Emmaus</td>
<td class="org-left">Mark 16:12-13, Luke 24:13-35</td>
</tr>

<tr>
<td class="org-left">3/24</td>
<td class="org-left">Jesus Appears to Ten Disciples</td>
<td class="org-left">Mark 16:14, Luke 24:36-49, John 20:19-25</td>
</tr>
</tbody>
</table>


<div class="tagline" id="org179dbd2">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Apr 08, 2025 19:52.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
